#loc = loc(unknown)
module @jit_run_cnn {
  func.func public @main(%arg0: tensor<32x64x64x10xf32> {jax.arg_info = "batch", mhlo.sharding = "{replicated}"} loc(unknown)) -> (tensor<32x10xf32> {jax.result_info = ""}) {
    %0 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %1 = stablehlo.constant dense<32> : tensor<i32> loc(#loc16)
    %2 = stablehlo.shift_right_logical %0, %1 : tensor<i32> loc(#loc17)
    %3 = stablehlo.convert %2 : (tensor<i32>) -> tensor<ui32> loc(#loc18)
    %4 = stablehlo.reshape %3 : (tensor<ui32>) -> tensor<1xui32> loc(#loc19)
    %5 = stablehlo.constant dense<4294967295> : tensor<ui32> loc(#loc16)
    %6 = stablehlo.convert %5 : (tensor<ui32>) -> tensor<i32> loc(#loc20)
    %7 = stablehlo.and %0, %6 : tensor<i32> loc(#loc21)
    %8 = stablehlo.convert %7 : (tensor<i32>) -> tensor<ui32> loc(#loc18)
    %9 = stablehlo.reshape %8 : (tensor<ui32>) -> tensor<1xui32> loc(#loc19)
    %10 = stablehlo.concatenate %4, %9, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc22)
    %11 = stablehlo.constant dense<1559354485> : tensor<ui32> loc(#loc)
    %12 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc23)
    %13 = stablehlo.shift_right_logical %11, %12 : tensor<ui32> loc(#loc24)
    %14 = stablehlo.reshape %13 : (tensor<ui32>) -> tensor<1xui32> loc(#loc25)
    %15 = stablehlo.constant dense<4294967295> : tensor<ui32> loc(#loc23)
    %16 = stablehlo.and %11, %15 : tensor<ui32> loc(#loc26)
    %17 = stablehlo.reshape %16 : (tensor<ui32>) -> tensor<1xui32> loc(#loc25)
    %18 = stablehlo.concatenate %14, %17, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc27)
    %19 = "stablehlo.slice"(%10) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc28)
    %20 = stablehlo.reshape %19 : (tensor<1xui32>) -> tensor<ui32> loc(#loc29)
    %21 = "stablehlo.slice"(%10) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc30)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc29)
    %23 = "stablehlo.slice"(%18) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc31)
    %24 = "stablehlo.slice"(%18) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc32)
    %25 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc33)
    %26 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc33)
    %27 = stablehlo.xor %20, %22 : tensor<ui32> loc(#loc34)
    %28 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc33)
    %29 = stablehlo.xor %27, %28 : tensor<ui32> loc(#loc34)
    %30 = stablehlo.broadcast_in_dim %20, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc35)
    %31 = stablehlo.add %23, %30 : tensor<1xui32> loc(#loc35)
    %32 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc35)
    %33 = stablehlo.add %24, %32 : tensor<1xui32> loc(#loc35)
    %34 = stablehlo.constant dense<0> : tensor<i32> loc(#loc33)
    %35 = stablehlo.constant dense<0> : tensor<i32> loc(#loc36)
    %36:9 = stablehlo.while(%iterArg = %35, %iterArg_0 = %34, %iterArg_1 = %31, %iterArg_2 = %33, %iterArg_3 = %22, %iterArg_4 = %29, %iterArg_5 = %20, %iterArg_6 = %25, %iterArg_7 = %26) : tensor<i32>, tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
     cond {
      %422 = stablehlo.constant dense<5> : tensor<i32> loc(#loc37)
      %423 = stablehlo.compare  LT, %iterArg, %422,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc38)
      stablehlo.return %423 : tensor<i1> loc(#loc37)
    } do {
      %422 = stablehlo.constant dense<1> : tensor<i32> loc(#loc37)
      %423 = stablehlo.add %iterArg_0, %422 : tensor<i32> loc(#loc39)
      %424 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc40)
      %425 = stablehlo.reshape %424 : (tensor<1xui32>) -> tensor<ui32> loc(#loc41)
      %426 = stablehlo.add %iterArg_1, %iterArg_2 : tensor<1xui32> loc(#loc39)
      %427 = stablehlo.broadcast_in_dim %425, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc42)
      %428 = stablehlo.shift_left %iterArg_2, %427 : tensor<1xui32> loc(#loc42)
      %429 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc37)
      %430 = stablehlo.subtract %429, %425 : tensor<ui32> loc(#loc43)
      %431 = stablehlo.broadcast_in_dim %430, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc44)
      %432 = stablehlo.shift_right_logical %iterArg_2, %431 : tensor<1xui32> loc(#loc44)
      %433 = stablehlo.or %428, %432 : tensor<1xui32> loc(#loc45)
      %434 = stablehlo.xor %426, %433 : tensor<1xui32> loc(#loc46)
      %435 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc47)
      %436 = stablehlo.reshape %435 : (tensor<1xui32>) -> tensor<ui32> loc(#loc41)
      %437 = stablehlo.add %426, %434 : tensor<1xui32> loc(#loc39)
      %438 = stablehlo.broadcast_in_dim %436, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc42)
      %439 = stablehlo.shift_left %434, %438 : tensor<1xui32> loc(#loc42)
      %440 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc37)
      %441 = stablehlo.subtract %440, %436 : tensor<ui32> loc(#loc43)
      %442 = stablehlo.broadcast_in_dim %441, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc44)
      %443 = stablehlo.shift_right_logical %434, %442 : tensor<1xui32> loc(#loc44)
      %444 = stablehlo.or %439, %443 : tensor<1xui32> loc(#loc45)
      %445 = stablehlo.xor %437, %444 : tensor<1xui32> loc(#loc46)
      %446 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<3> : tensor<1xi64>, start_indices = dense<2> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc48)
      %447 = stablehlo.reshape %446 : (tensor<1xui32>) -> tensor<ui32> loc(#loc41)
      %448 = stablehlo.add %437, %445 : tensor<1xui32> loc(#loc39)
      %449 = stablehlo.broadcast_in_dim %447, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc42)
      %450 = stablehlo.shift_left %445, %449 : tensor<1xui32> loc(#loc42)
      %451 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc37)
      %452 = stablehlo.subtract %451, %447 : tensor<ui32> loc(#loc43)
      %453 = stablehlo.broadcast_in_dim %452, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc44)
      %454 = stablehlo.shift_right_logical %445, %453 : tensor<1xui32> loc(#loc44)
      %455 = stablehlo.or %450, %454 : tensor<1xui32> loc(#loc45)
      %456 = stablehlo.xor %448, %455 : tensor<1xui32> loc(#loc46)
      %457 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<4> : tensor<1xi64>, start_indices = dense<3> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc49)
      %458 = stablehlo.reshape %457 : (tensor<1xui32>) -> tensor<ui32> loc(#loc41)
      %459 = stablehlo.add %448, %456 : tensor<1xui32> loc(#loc39)
      %460 = stablehlo.broadcast_in_dim %458, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc42)
      %461 = stablehlo.shift_left %456, %460 : tensor<1xui32> loc(#loc42)
      %462 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc37)
      %463 = stablehlo.subtract %462, %458 : tensor<ui32> loc(#loc43)
      %464 = stablehlo.broadcast_in_dim %463, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc44)
      %465 = stablehlo.shift_right_logical %456, %464 : tensor<1xui32> loc(#loc44)
      %466 = stablehlo.or %461, %465 : tensor<1xui32> loc(#loc45)
      %467 = stablehlo.xor %459, %466 : tensor<1xui32> loc(#loc46)
      %468 = stablehlo.broadcast_in_dim %iterArg_3, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc39)
      %469 = stablehlo.add %459, %468 : tensor<1xui32> loc(#loc39)
      %470 = stablehlo.broadcast_in_dim %iterArg_4, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc39)
      %471 = stablehlo.add %467, %470 : tensor<1xui32> loc(#loc39)
      %472 = stablehlo.constant dense<1> : tensor<i32> loc(#loc37)
      %473 = stablehlo.add %iterArg_0, %472 : tensor<i32> loc(#loc39)
      %474 = stablehlo.convert %473 : (tensor<i32>) -> tensor<ui32> loc(#loc50)
      %475 = stablehlo.broadcast_in_dim %474, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc39)
      %476 = stablehlo.add %471, %475 : tensor<1xui32> loc(#loc39)
      %477 = stablehlo.constant dense<1> : tensor<i32> loc(#loc37)
      %478 = stablehlo.add %iterArg, %477 : tensor<i32> loc(#loc39)
      stablehlo.return %478, %423, %469, %476, %iterArg_4, %iterArg_5, %iterArg_3, %iterArg_7, %iterArg_6 : tensor<i32>, tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc37)
    } loc(#loc37)
    %37 = stablehlo.concatenate %36#2, %36#3, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc27)
    %38 = stablehlo.constant dense<0.0111111114> : tensor<f32> loc(#loc)
    %39 = stablehlo.sqrt %38 : tensor<f32> loc(#loc51)
    %40 = stablehlo.constant dense<0.879625678> : tensor<f32> loc(#loc)
    %41 = stablehlo.divide %39, %40 : tensor<f32> loc(#loc52)
    %42 = stablehlo.constant dense<-2.000000e+00> : tensor<f32> loc(#loc)
    %43 = stablehlo.constant dense<1.41421354> : tensor<f32> loc(#loc)
    %44 = stablehlo.divide %42, %43 : tensor<f32> loc(#loc52)
    %45 = chlo.erf %44 : tensor<f32> -> tensor<f32> loc(#loc53)
    %46 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %47 = stablehlo.constant dense<1.41421354> : tensor<f32> loc(#loc)
    %48 = stablehlo.divide %46, %47 : tensor<f32> loc(#loc52)
    %49 = chlo.erf %48 : tensor<f32> -> tensor<f32> loc(#loc53)
    %50 = stablehlo.broadcast_in_dim %45, dims = [] : (tensor<f32>) -> tensor<1x1x1x1xf32> loc(#loc54)
    %51 = stablehlo.broadcast_in_dim %49, dims = [] : (tensor<f32>) -> tensor<1x1x1x1xf32> loc(#loc54)
    %52 = stablehlo.iota dim = 0 : tensor<2880xui32> loc(#loc55)
    %53 = "stablehlo.slice"(%37) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc56)
    %54 = stablehlo.reshape %53 : (tensor<1xui32>) -> tensor<ui32> loc(#loc57)
    %55 = "stablehlo.slice"(%37) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc58)
    %56 = stablehlo.reshape %55 : (tensor<1xui32>) -> tensor<ui32> loc(#loc57)
    %57 = "stablehlo.slice"(%52) {limit_indices = dense<1440> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2880xui32>) -> tensor<1440xui32> loc(#loc59)
    %58 = "stablehlo.slice"(%52) {limit_indices = dense<2880> : tensor<1xi64>, start_indices = dense<1440> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2880xui32>) -> tensor<1440xui32> loc(#loc60)
    %59 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc61)
    %60 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc61)
    %61 = stablehlo.xor %54, %56 : tensor<ui32> loc(#loc34)
    %62 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc61)
    %63 = stablehlo.xor %61, %62 : tensor<ui32> loc(#loc34)
    %64 = stablehlo.broadcast_in_dim %54, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc62)
    %65 = stablehlo.add %57, %64 : tensor<1440xui32> loc(#loc62)
    %66 = stablehlo.broadcast_in_dim %56, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc62)
    %67 = stablehlo.add %58, %66 : tensor<1440xui32> loc(#loc62)
    %68 = stablehlo.constant dense<0> : tensor<i32> loc(#loc61)
    %69 = stablehlo.constant dense<0> : tensor<i32> loc(#loc63)
    %70:9 = stablehlo.while(%iterArg = %69, %iterArg_0 = %68, %iterArg_1 = %65, %iterArg_2 = %67, %iterArg_3 = %56, %iterArg_4 = %63, %iterArg_5 = %54, %iterArg_6 = %59, %iterArg_7 = %60) : tensor<i32>, tensor<i32>, tensor<1440xui32>, tensor<1440xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
     cond {
      %422 = stablehlo.constant dense<5> : tensor<i32> loc(#loc64)
      %423 = stablehlo.compare  LT, %iterArg, %422,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc38)
      stablehlo.return %423 : tensor<i1> loc(#loc64)
    } do {
      %422 = stablehlo.constant dense<1> : tensor<i32> loc(#loc64)
      %423 = stablehlo.add %iterArg_0, %422 : tensor<i32> loc(#loc39)
      %424 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc65)
      %425 = stablehlo.reshape %424 : (tensor<1xui32>) -> tensor<ui32> loc(#loc66)
      %426 = stablehlo.add %iterArg_1, %iterArg_2 : tensor<1440xui32> loc(#loc67)
      %427 = stablehlo.broadcast_in_dim %425, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc68)
      %428 = stablehlo.shift_left %iterArg_2, %427 : tensor<1440xui32> loc(#loc68)
      %429 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc64)
      %430 = stablehlo.subtract %429, %425 : tensor<ui32> loc(#loc43)
      %431 = stablehlo.broadcast_in_dim %430, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc69)
      %432 = stablehlo.shift_right_logical %iterArg_2, %431 : tensor<1440xui32> loc(#loc69)
      %433 = stablehlo.or %428, %432 : tensor<1440xui32> loc(#loc70)
      %434 = stablehlo.xor %426, %433 : tensor<1440xui32> loc(#loc71)
      %435 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc72)
      %436 = stablehlo.reshape %435 : (tensor<1xui32>) -> tensor<ui32> loc(#loc66)
      %437 = stablehlo.add %426, %434 : tensor<1440xui32> loc(#loc67)
      %438 = stablehlo.broadcast_in_dim %436, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc68)
      %439 = stablehlo.shift_left %434, %438 : tensor<1440xui32> loc(#loc68)
      %440 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc64)
      %441 = stablehlo.subtract %440, %436 : tensor<ui32> loc(#loc43)
      %442 = stablehlo.broadcast_in_dim %441, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc69)
      %443 = stablehlo.shift_right_logical %434, %442 : tensor<1440xui32> loc(#loc69)
      %444 = stablehlo.or %439, %443 : tensor<1440xui32> loc(#loc70)
      %445 = stablehlo.xor %437, %444 : tensor<1440xui32> loc(#loc71)
      %446 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<3> : tensor<1xi64>, start_indices = dense<2> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc73)
      %447 = stablehlo.reshape %446 : (tensor<1xui32>) -> tensor<ui32> loc(#loc66)
      %448 = stablehlo.add %437, %445 : tensor<1440xui32> loc(#loc67)
      %449 = stablehlo.broadcast_in_dim %447, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc68)
      %450 = stablehlo.shift_left %445, %449 : tensor<1440xui32> loc(#loc68)
      %451 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc64)
      %452 = stablehlo.subtract %451, %447 : tensor<ui32> loc(#loc43)
      %453 = stablehlo.broadcast_in_dim %452, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc69)
      %454 = stablehlo.shift_right_logical %445, %453 : tensor<1440xui32> loc(#loc69)
      %455 = stablehlo.or %450, %454 : tensor<1440xui32> loc(#loc70)
      %456 = stablehlo.xor %448, %455 : tensor<1440xui32> loc(#loc71)
      %457 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<4> : tensor<1xi64>, start_indices = dense<3> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc74)
      %458 = stablehlo.reshape %457 : (tensor<1xui32>) -> tensor<ui32> loc(#loc66)
      %459 = stablehlo.add %448, %456 : tensor<1440xui32> loc(#loc67)
      %460 = stablehlo.broadcast_in_dim %458, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc68)
      %461 = stablehlo.shift_left %456, %460 : tensor<1440xui32> loc(#loc68)
      %462 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc64)
      %463 = stablehlo.subtract %462, %458 : tensor<ui32> loc(#loc43)
      %464 = stablehlo.broadcast_in_dim %463, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc69)
      %465 = stablehlo.shift_right_logical %456, %464 : tensor<1440xui32> loc(#loc69)
      %466 = stablehlo.or %461, %465 : tensor<1440xui32> loc(#loc70)
      %467 = stablehlo.xor %459, %466 : tensor<1440xui32> loc(#loc71)
      %468 = stablehlo.broadcast_in_dim %iterArg_3, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc67)
      %469 = stablehlo.add %459, %468 : tensor<1440xui32> loc(#loc67)
      %470 = stablehlo.broadcast_in_dim %iterArg_4, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc67)
      %471 = stablehlo.add %467, %470 : tensor<1440xui32> loc(#loc67)
      %472 = stablehlo.constant dense<1> : tensor<i32> loc(#loc64)
      %473 = stablehlo.add %iterArg_0, %472 : tensor<i32> loc(#loc39)
      %474 = stablehlo.convert %473 : (tensor<i32>) -> tensor<ui32> loc(#loc75)
      %475 = stablehlo.broadcast_in_dim %474, dims = [] : (tensor<ui32>) -> tensor<1440xui32> loc(#loc67)
      %476 = stablehlo.add %471, %475 : tensor<1440xui32> loc(#loc67)
      %477 = stablehlo.constant dense<1> : tensor<i32> loc(#loc64)
      %478 = stablehlo.add %iterArg, %477 : tensor<i32> loc(#loc39)
      stablehlo.return %478, %423, %469, %476, %iterArg_4, %iterArg_5, %iterArg_3, %iterArg_7, %iterArg_6 : tensor<i32>, tensor<i32>, tensor<1440xui32>, tensor<1440xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc64)
    } loc(#loc64)
    %71 = stablehlo.concatenate %70#2, %70#3, dim = 0 : (tensor<1440xui32>, tensor<1440xui32>) -> tensor<2880xui32> loc(#loc76)
    %72 = stablehlo.reshape %71 : (tensor<2880xui32>) -> tensor<3x3x10x32xui32> loc(#loc77)
    %73 = stablehlo.constant dense<9> : tensor<ui32> loc(#loc)
    %74 = stablehlo.broadcast_in_dim %73, dims = [] : (tensor<ui32>) -> tensor<3x3x10x32xui32> loc(#loc78)
    %75 = stablehlo.shift_right_logical %72, %74 : tensor<3x3x10x32xui32> loc(#loc78)
    %76 = stablehlo.constant dense<1065353216> : tensor<ui32> loc(#loc)
    %77 = stablehlo.broadcast_in_dim %76, dims = [] : (tensor<ui32>) -> tensor<3x3x10x32xui32> loc(#loc79)
    %78 = stablehlo.or %75, %77 : tensor<3x3x10x32xui32> loc(#loc79)
    %79 = stablehlo.bitcast_convert %78 : (tensor<3x3x10x32xui32>) -> tensor<3x3x10x32xf32> loc(#loc80)
    %80 = stablehlo.constant dense<1.000000e+00> : tensor<f32> loc(#loc)
    %81 = stablehlo.broadcast_in_dim %80, dims = [] : (tensor<f32>) -> tensor<3x3x10x32xf32> loc(#loc81)
    %82 = stablehlo.subtract %79, %81 : tensor<3x3x10x32xf32> loc(#loc81)
    %83 = stablehlo.subtract %51, %50 : tensor<1x1x1x1xf32> loc(#loc81)
    %84 = stablehlo.broadcast_in_dim %83, dims = [0, 1, 2, 3] : (tensor<1x1x1x1xf32>) -> tensor<3x3x10x32xf32> loc(#loc82)
    %85 = stablehlo.multiply %82, %84 : tensor<3x3x10x32xf32> loc(#loc82)
    %86 = stablehlo.broadcast_in_dim %50, dims = [0, 1, 2, 3] : (tensor<1x1x1x1xf32>) -> tensor<3x3x10x32xf32> loc(#loc62)
    %87 = stablehlo.add %85, %86 : tensor<3x3x10x32xf32> loc(#loc62)
    %88 = stablehlo.broadcast_in_dim %50, dims = [0, 1, 2, 3] : (tensor<1x1x1x1xf32>) -> tensor<3x3x10x32xf32> loc(#loc83)
    %89 = stablehlo.maximum %88, %87 : tensor<3x3x10x32xf32> loc(#loc83)
    %90 = chlo.erf_inv %89 : tensor<3x3x10x32xf32> -> tensor<3x3x10x32xf32> loc(#loc84)
    %91 = stablehlo.constant dense<1.41421354> : tensor<f32> loc(#loc)
    %92 = stablehlo.broadcast_in_dim %91, dims = [] : (tensor<f32>) -> tensor<3x3x10x32xf32> loc(#loc82)
    %93 = stablehlo.multiply %92, %90 : tensor<3x3x10x32xf32> loc(#loc82)
    %94 = stablehlo.constant dense<-2.000000e+00> : tensor<f32> loc(#loc)
    %95 = stablehlo.constant dense<0x7F800000> : tensor<f32> loc(#loc)
    %96 = chlo.next_after %94, %95 : tensor<f32>, tensor<f32> -> tensor<f32> loc(#loc85)
    %97 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %98 = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc)
    %99 = chlo.next_after %97, %98 : tensor<f32>, tensor<f32> -> tensor<f32> loc(#loc85)
    %100 = call @clip(%93, %96, %99) : (tensor<3x3x10x32xf32>, tensor<f32>, tensor<f32>) -> tensor<3x3x10x32xf32> loc(#loc86)
    %101 = stablehlo.broadcast_in_dim %41, dims = [] : (tensor<f32>) -> tensor<3x3x10x32xf32> loc(#loc82)
    %102 = stablehlo.multiply %100, %101 : tensor<3x3x10x32xf32> loc(#loc82)
    %103 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %104 = stablehlo.broadcast_in_dim %103, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc87)
    %105 = stablehlo.constant dense<1643651158> : tensor<ui32> loc(#loc)
    %106 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc88)
    %107 = stablehlo.shift_right_logical %105, %106 : tensor<ui32> loc(#loc89)
    %108 = stablehlo.reshape %107 : (tensor<ui32>) -> tensor<1xui32> loc(#loc90)
    %109 = stablehlo.constant dense<4294967295> : tensor<ui32> loc(#loc88)
    %110 = stablehlo.and %105, %109 : tensor<ui32> loc(#loc91)
    %111 = stablehlo.reshape %110 : (tensor<ui32>) -> tensor<1xui32> loc(#loc90)
    %112 = stablehlo.concatenate %108, %111, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc92)
    %113 = "stablehlo.slice"(%10) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc93)
    %114 = stablehlo.reshape %113 : (tensor<1xui32>) -> tensor<ui32> loc(#loc94)
    %115 = "stablehlo.slice"(%10) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc95)
    %116 = stablehlo.reshape %115 : (tensor<1xui32>) -> tensor<ui32> loc(#loc94)
    %117 = "stablehlo.slice"(%112) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc96)
    %118 = "stablehlo.slice"(%112) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc97)
    %119 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc98)
    %120 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc98)
    %121 = stablehlo.xor %114, %116 : tensor<ui32> loc(#loc99)
    %122 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc98)
    %123 = stablehlo.xor %121, %122 : tensor<ui32> loc(#loc99)
    %124 = stablehlo.broadcast_in_dim %114, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc100)
    %125 = stablehlo.add %117, %124 : tensor<1xui32> loc(#loc100)
    %126 = stablehlo.broadcast_in_dim %116, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc100)
    %127 = stablehlo.add %118, %126 : tensor<1xui32> loc(#loc100)
    %128 = stablehlo.constant dense<0> : tensor<i32> loc(#loc98)
    %129 = stablehlo.constant dense<0> : tensor<i32> loc(#loc101)
    %130:9 = stablehlo.while(%iterArg = %129, %iterArg_0 = %128, %iterArg_1 = %125, %iterArg_2 = %127, %iterArg_3 = %116, %iterArg_4 = %123, %iterArg_5 = %114, %iterArg_6 = %119, %iterArg_7 = %120) : tensor<i32>, tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
     cond {
      %422 = stablehlo.constant dense<5> : tensor<i32> loc(#loc102)
      %423 = stablehlo.compare  LT, %iterArg, %422,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc103)
      stablehlo.return %423 : tensor<i1> loc(#loc102)
    } do {
      %422 = stablehlo.constant dense<1> : tensor<i32> loc(#loc102)
      %423 = stablehlo.add %iterArg_0, %422 : tensor<i32> loc(#loc104)
      %424 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc105)
      %425 = stablehlo.reshape %424 : (tensor<1xui32>) -> tensor<ui32> loc(#loc106)
      %426 = stablehlo.add %iterArg_1, %iterArg_2 : tensor<1xui32> loc(#loc104)
      %427 = stablehlo.broadcast_in_dim %425, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc107)
      %428 = stablehlo.shift_left %iterArg_2, %427 : tensor<1xui32> loc(#loc107)
      %429 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc102)
      %430 = stablehlo.subtract %429, %425 : tensor<ui32> loc(#loc108)
      %431 = stablehlo.broadcast_in_dim %430, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc109)
      %432 = stablehlo.shift_right_logical %iterArg_2, %431 : tensor<1xui32> loc(#loc109)
      %433 = stablehlo.or %428, %432 : tensor<1xui32> loc(#loc110)
      %434 = stablehlo.xor %426, %433 : tensor<1xui32> loc(#loc111)
      %435 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc112)
      %436 = stablehlo.reshape %435 : (tensor<1xui32>) -> tensor<ui32> loc(#loc106)
      %437 = stablehlo.add %426, %434 : tensor<1xui32> loc(#loc104)
      %438 = stablehlo.broadcast_in_dim %436, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc107)
      %439 = stablehlo.shift_left %434, %438 : tensor<1xui32> loc(#loc107)
      %440 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc102)
      %441 = stablehlo.subtract %440, %436 : tensor<ui32> loc(#loc108)
      %442 = stablehlo.broadcast_in_dim %441, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc109)
      %443 = stablehlo.shift_right_logical %434, %442 : tensor<1xui32> loc(#loc109)
      %444 = stablehlo.or %439, %443 : tensor<1xui32> loc(#loc110)
      %445 = stablehlo.xor %437, %444 : tensor<1xui32> loc(#loc111)
      %446 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<3> : tensor<1xi64>, start_indices = dense<2> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc113)
      %447 = stablehlo.reshape %446 : (tensor<1xui32>) -> tensor<ui32> loc(#loc106)
      %448 = stablehlo.add %437, %445 : tensor<1xui32> loc(#loc104)
      %449 = stablehlo.broadcast_in_dim %447, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc107)
      %450 = stablehlo.shift_left %445, %449 : tensor<1xui32> loc(#loc107)
      %451 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc102)
      %452 = stablehlo.subtract %451, %447 : tensor<ui32> loc(#loc108)
      %453 = stablehlo.broadcast_in_dim %452, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc109)
      %454 = stablehlo.shift_right_logical %445, %453 : tensor<1xui32> loc(#loc109)
      %455 = stablehlo.or %450, %454 : tensor<1xui32> loc(#loc110)
      %456 = stablehlo.xor %448, %455 : tensor<1xui32> loc(#loc111)
      %457 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<4> : tensor<1xi64>, start_indices = dense<3> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc114)
      %458 = stablehlo.reshape %457 : (tensor<1xui32>) -> tensor<ui32> loc(#loc106)
      %459 = stablehlo.add %448, %456 : tensor<1xui32> loc(#loc104)
      %460 = stablehlo.broadcast_in_dim %458, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc107)
      %461 = stablehlo.shift_left %456, %460 : tensor<1xui32> loc(#loc107)
      %462 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc102)
      %463 = stablehlo.subtract %462, %458 : tensor<ui32> loc(#loc108)
      %464 = stablehlo.broadcast_in_dim %463, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc109)
      %465 = stablehlo.shift_right_logical %456, %464 : tensor<1xui32> loc(#loc109)
      %466 = stablehlo.or %461, %465 : tensor<1xui32> loc(#loc110)
      %467 = stablehlo.xor %459, %466 : tensor<1xui32> loc(#loc111)
      %468 = stablehlo.broadcast_in_dim %iterArg_3, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc104)
      %469 = stablehlo.add %459, %468 : tensor<1xui32> loc(#loc104)
      %470 = stablehlo.broadcast_in_dim %iterArg_4, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc104)
      %471 = stablehlo.add %467, %470 : tensor<1xui32> loc(#loc104)
      %472 = stablehlo.constant dense<1> : tensor<i32> loc(#loc102)
      %473 = stablehlo.add %iterArg_0, %472 : tensor<i32> loc(#loc104)
      %474 = stablehlo.convert %473 : (tensor<i32>) -> tensor<ui32> loc(#loc115)
      %475 = stablehlo.broadcast_in_dim %474, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc104)
      %476 = stablehlo.add %471, %475 : tensor<1xui32> loc(#loc104)
      %477 = stablehlo.constant dense<1> : tensor<i32> loc(#loc102)
      %478 = stablehlo.add %iterArg, %477 : tensor<i32> loc(#loc104)
      stablehlo.return %478, %423, %469, %476, %iterArg_4, %iterArg_5, %iterArg_3, %iterArg_7, %iterArg_6 : tensor<i32>, tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc102)
    } loc(#loc102)
    %131 = stablehlo.concatenate %130#2, %130#3, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc92)
    %132 = stablehlo.constant dense<0.00347222225> : tensor<f32> loc(#loc)
    %133 = stablehlo.sqrt %132 : tensor<f32> loc(#loc116)
    %134 = stablehlo.constant dense<0.879625678> : tensor<f32> loc(#loc)
    %135 = stablehlo.divide %133, %134 : tensor<f32> loc(#loc117)
    %136 = stablehlo.constant dense<-2.000000e+00> : tensor<f32> loc(#loc)
    %137 = stablehlo.constant dense<1.41421354> : tensor<f32> loc(#loc)
    %138 = stablehlo.divide %136, %137 : tensor<f32> loc(#loc117)
    %139 = chlo.erf %138 : tensor<f32> -> tensor<f32> loc(#loc118)
    %140 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %141 = stablehlo.constant dense<1.41421354> : tensor<f32> loc(#loc)
    %142 = stablehlo.divide %140, %141 : tensor<f32> loc(#loc117)
    %143 = chlo.erf %142 : tensor<f32> -> tensor<f32> loc(#loc118)
    %144 = stablehlo.broadcast_in_dim %139, dims = [] : (tensor<f32>) -> tensor<1x1x1x1xf32> loc(#loc119)
    %145 = stablehlo.broadcast_in_dim %143, dims = [] : (tensor<f32>) -> tensor<1x1x1x1xf32> loc(#loc119)
    %146 = stablehlo.iota dim = 0 : tensor<18432xui32> loc(#loc120)
    %147 = "stablehlo.slice"(%131) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc121)
    %148 = stablehlo.reshape %147 : (tensor<1xui32>) -> tensor<ui32> loc(#loc122)
    %149 = "stablehlo.slice"(%131) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc123)
    %150 = stablehlo.reshape %149 : (tensor<1xui32>) -> tensor<ui32> loc(#loc122)
    %151 = "stablehlo.slice"(%146) {limit_indices = dense<9216> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<18432xui32>) -> tensor<9216xui32> loc(#loc124)
    %152 = "stablehlo.slice"(%146) {limit_indices = dense<18432> : tensor<1xi64>, start_indices = dense<9216> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<18432xui32>) -> tensor<9216xui32> loc(#loc125)
    %153 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc126)
    %154 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc126)
    %155 = stablehlo.xor %148, %150 : tensor<ui32> loc(#loc99)
    %156 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc126)
    %157 = stablehlo.xor %155, %156 : tensor<ui32> loc(#loc99)
    %158 = stablehlo.broadcast_in_dim %148, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc127)
    %159 = stablehlo.add %151, %158 : tensor<9216xui32> loc(#loc127)
    %160 = stablehlo.broadcast_in_dim %150, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc127)
    %161 = stablehlo.add %152, %160 : tensor<9216xui32> loc(#loc127)
    %162 = stablehlo.constant dense<0> : tensor<i32> loc(#loc126)
    %163 = stablehlo.constant dense<0> : tensor<i32> loc(#loc128)
    %164:9 = stablehlo.while(%iterArg = %163, %iterArg_0 = %162, %iterArg_1 = %159, %iterArg_2 = %161, %iterArg_3 = %150, %iterArg_4 = %157, %iterArg_5 = %148, %iterArg_6 = %153, %iterArg_7 = %154) : tensor<i32>, tensor<i32>, tensor<9216xui32>, tensor<9216xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
     cond {
      %422 = stablehlo.constant dense<5> : tensor<i32> loc(#loc129)
      %423 = stablehlo.compare  LT, %iterArg, %422,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc103)
      stablehlo.return %423 : tensor<i1> loc(#loc129)
    } do {
      %422 = stablehlo.constant dense<1> : tensor<i32> loc(#loc129)
      %423 = stablehlo.add %iterArg_0, %422 : tensor<i32> loc(#loc104)
      %424 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc130)
      %425 = stablehlo.reshape %424 : (tensor<1xui32>) -> tensor<ui32> loc(#loc131)
      %426 = stablehlo.add %iterArg_1, %iterArg_2 : tensor<9216xui32> loc(#loc132)
      %427 = stablehlo.broadcast_in_dim %425, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc133)
      %428 = stablehlo.shift_left %iterArg_2, %427 : tensor<9216xui32> loc(#loc133)
      %429 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc129)
      %430 = stablehlo.subtract %429, %425 : tensor<ui32> loc(#loc108)
      %431 = stablehlo.broadcast_in_dim %430, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc134)
      %432 = stablehlo.shift_right_logical %iterArg_2, %431 : tensor<9216xui32> loc(#loc134)
      %433 = stablehlo.or %428, %432 : tensor<9216xui32> loc(#loc135)
      %434 = stablehlo.xor %426, %433 : tensor<9216xui32> loc(#loc136)
      %435 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc137)
      %436 = stablehlo.reshape %435 : (tensor<1xui32>) -> tensor<ui32> loc(#loc131)
      %437 = stablehlo.add %426, %434 : tensor<9216xui32> loc(#loc132)
      %438 = stablehlo.broadcast_in_dim %436, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc133)
      %439 = stablehlo.shift_left %434, %438 : tensor<9216xui32> loc(#loc133)
      %440 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc129)
      %441 = stablehlo.subtract %440, %436 : tensor<ui32> loc(#loc108)
      %442 = stablehlo.broadcast_in_dim %441, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc134)
      %443 = stablehlo.shift_right_logical %434, %442 : tensor<9216xui32> loc(#loc134)
      %444 = stablehlo.or %439, %443 : tensor<9216xui32> loc(#loc135)
      %445 = stablehlo.xor %437, %444 : tensor<9216xui32> loc(#loc136)
      %446 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<3> : tensor<1xi64>, start_indices = dense<2> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc138)
      %447 = stablehlo.reshape %446 : (tensor<1xui32>) -> tensor<ui32> loc(#loc131)
      %448 = stablehlo.add %437, %445 : tensor<9216xui32> loc(#loc132)
      %449 = stablehlo.broadcast_in_dim %447, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc133)
      %450 = stablehlo.shift_left %445, %449 : tensor<9216xui32> loc(#loc133)
      %451 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc129)
      %452 = stablehlo.subtract %451, %447 : tensor<ui32> loc(#loc108)
      %453 = stablehlo.broadcast_in_dim %452, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc134)
      %454 = stablehlo.shift_right_logical %445, %453 : tensor<9216xui32> loc(#loc134)
      %455 = stablehlo.or %450, %454 : tensor<9216xui32> loc(#loc135)
      %456 = stablehlo.xor %448, %455 : tensor<9216xui32> loc(#loc136)
      %457 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<4> : tensor<1xi64>, start_indices = dense<3> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc139)
      %458 = stablehlo.reshape %457 : (tensor<1xui32>) -> tensor<ui32> loc(#loc131)
      %459 = stablehlo.add %448, %456 : tensor<9216xui32> loc(#loc132)
      %460 = stablehlo.broadcast_in_dim %458, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc133)
      %461 = stablehlo.shift_left %456, %460 : tensor<9216xui32> loc(#loc133)
      %462 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc129)
      %463 = stablehlo.subtract %462, %458 : tensor<ui32> loc(#loc108)
      %464 = stablehlo.broadcast_in_dim %463, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc134)
      %465 = stablehlo.shift_right_logical %456, %464 : tensor<9216xui32> loc(#loc134)
      %466 = stablehlo.or %461, %465 : tensor<9216xui32> loc(#loc135)
      %467 = stablehlo.xor %459, %466 : tensor<9216xui32> loc(#loc136)
      %468 = stablehlo.broadcast_in_dim %iterArg_3, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc132)
      %469 = stablehlo.add %459, %468 : tensor<9216xui32> loc(#loc132)
      %470 = stablehlo.broadcast_in_dim %iterArg_4, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc132)
      %471 = stablehlo.add %467, %470 : tensor<9216xui32> loc(#loc132)
      %472 = stablehlo.constant dense<1> : tensor<i32> loc(#loc129)
      %473 = stablehlo.add %iterArg_0, %472 : tensor<i32> loc(#loc104)
      %474 = stablehlo.convert %473 : (tensor<i32>) -> tensor<ui32> loc(#loc140)
      %475 = stablehlo.broadcast_in_dim %474, dims = [] : (tensor<ui32>) -> tensor<9216xui32> loc(#loc132)
      %476 = stablehlo.add %471, %475 : tensor<9216xui32> loc(#loc132)
      %477 = stablehlo.constant dense<1> : tensor<i32> loc(#loc129)
      %478 = stablehlo.add %iterArg, %477 : tensor<i32> loc(#loc104)
      stablehlo.return %478, %423, %469, %476, %iterArg_4, %iterArg_5, %iterArg_3, %iterArg_7, %iterArg_6 : tensor<i32>, tensor<i32>, tensor<9216xui32>, tensor<9216xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc129)
    } loc(#loc129)
    %165 = stablehlo.concatenate %164#2, %164#3, dim = 0 : (tensor<9216xui32>, tensor<9216xui32>) -> tensor<18432xui32> loc(#loc141)
    %166 = stablehlo.reshape %165 : (tensor<18432xui32>) -> tensor<3x3x32x64xui32> loc(#loc142)
    %167 = stablehlo.constant dense<9> : tensor<ui32> loc(#loc)
    %168 = stablehlo.broadcast_in_dim %167, dims = [] : (tensor<ui32>) -> tensor<3x3x32x64xui32> loc(#loc143)
    %169 = stablehlo.shift_right_logical %166, %168 : tensor<3x3x32x64xui32> loc(#loc143)
    %170 = stablehlo.constant dense<1065353216> : tensor<ui32> loc(#loc)
    %171 = stablehlo.broadcast_in_dim %170, dims = [] : (tensor<ui32>) -> tensor<3x3x32x64xui32> loc(#loc144)
    %172 = stablehlo.or %169, %171 : tensor<3x3x32x64xui32> loc(#loc144)
    %173 = stablehlo.bitcast_convert %172 : (tensor<3x3x32x64xui32>) -> tensor<3x3x32x64xf32> loc(#loc145)
    %174 = stablehlo.constant dense<1.000000e+00> : tensor<f32> loc(#loc)
    %175 = stablehlo.broadcast_in_dim %174, dims = [] : (tensor<f32>) -> tensor<3x3x32x64xf32> loc(#loc146)
    %176 = stablehlo.subtract %173, %175 : tensor<3x3x32x64xf32> loc(#loc146)
    %177 = stablehlo.subtract %145, %144 : tensor<1x1x1x1xf32> loc(#loc146)
    %178 = stablehlo.broadcast_in_dim %177, dims = [0, 1, 2, 3] : (tensor<1x1x1x1xf32>) -> tensor<3x3x32x64xf32> loc(#loc147)
    %179 = stablehlo.multiply %176, %178 : tensor<3x3x32x64xf32> loc(#loc147)
    %180 = stablehlo.broadcast_in_dim %144, dims = [0, 1, 2, 3] : (tensor<1x1x1x1xf32>) -> tensor<3x3x32x64xf32> loc(#loc127)
    %181 = stablehlo.add %179, %180 : tensor<3x3x32x64xf32> loc(#loc127)
    %182 = stablehlo.broadcast_in_dim %144, dims = [0, 1, 2, 3] : (tensor<1x1x1x1xf32>) -> tensor<3x3x32x64xf32> loc(#loc148)
    %183 = stablehlo.maximum %182, %181 : tensor<3x3x32x64xf32> loc(#loc148)
    %184 = chlo.erf_inv %183 : tensor<3x3x32x64xf32> -> tensor<3x3x32x64xf32> loc(#loc149)
    %185 = stablehlo.constant dense<1.41421354> : tensor<f32> loc(#loc)
    %186 = stablehlo.broadcast_in_dim %185, dims = [] : (tensor<f32>) -> tensor<3x3x32x64xf32> loc(#loc147)
    %187 = stablehlo.multiply %186, %184 : tensor<3x3x32x64xf32> loc(#loc147)
    %188 = stablehlo.constant dense<-2.000000e+00> : tensor<f32> loc(#loc)
    %189 = stablehlo.constant dense<0x7F800000> : tensor<f32> loc(#loc)
    %190 = chlo.next_after %188, %189 : tensor<f32>, tensor<f32> -> tensor<f32> loc(#loc150)
    %191 = stablehlo.constant dense<2.000000e+00> : tensor<f32> loc(#loc)
    %192 = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc)
    %193 = chlo.next_after %191, %192 : tensor<f32>, tensor<f32> -> tensor<f32> loc(#loc150)
    %194 = call @clip_0(%187, %190, %193) : (tensor<3x3x32x64xf32>, tensor<f32>, tensor<f32>) -> tensor<3x3x32x64xf32> loc(#loc151)
    %195 = stablehlo.broadcast_in_dim %135, dims = [] : (tensor<f32>) -> tensor<3x3x32x64xf32> loc(#loc147)
    %196 = stablehlo.multiply %194, %195 : tensor<3x3x32x64xf32> loc(#loc147)
    %197 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %198 = stablehlo.broadcast_in_dim %197, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc152)
    %199 = stablehlo.constant dense<2998342421> : tensor<ui32> loc(#loc)
    %200 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc153)
    %201 = stablehlo.shift_right_logical %199, %200 : tensor<ui32> loc(#loc154)
    %202 = stablehlo.reshape %201 : (tensor<ui32>) -> tensor<1xui32> loc(#loc155)
    %203 = stablehlo.constant dense<4294967295> : tensor<ui32> loc(#loc153)
    %204 = stablehlo.and %199, %203 : tensor<ui32> loc(#loc156)
    %205 = stablehlo.reshape %204 : (tensor<ui32>) -> tensor<1xui32> loc(#loc155)
    %206 = stablehlo.concatenate %202, %205, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc157)
    %207 = "stablehlo.slice"(%10) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc158)
    %208 = stablehlo.reshape %207 : (tensor<1xui32>) -> tensor<ui32> loc(#loc159)
    %209 = "stablehlo.slice"(%10) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc160)
    %210 = stablehlo.reshape %209 : (tensor<1xui32>) -> tensor<ui32> loc(#loc159)
    %211 = "stablehlo.slice"(%206) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc161)
    %212 = "stablehlo.slice"(%206) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<2xui32>) -> tensor<1xui32> loc(#loc162)
    %213 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc163)
    %214 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc163)
    %215 = stablehlo.xor %208, %210 : tensor<ui32> loc(#loc164)
    %216 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc163)
    %217 = stablehlo.xor %215, %216 : tensor<ui32> loc(#loc164)
    %218 = stablehlo.broadcast_in_dim %208, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc165)
    %219 = stablehlo.add %211, %218 : tensor<1xui32> loc(#loc165)
    %220 = stablehlo.broadcast_in_dim %210, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc165)
    %221 = stablehlo.add %212, %220 : tensor<1xui32> loc(#loc165)
    %222 = stablehlo.constant dense<0> : tensor<i32> loc(#loc163)
    %223 = stablehlo.constant dense<0> : tensor<i32> loc(#loc166)
    %224:9 = stablehlo.while(%iterArg = %223, %iterArg_0 = %222, %iterArg_1 = %219, %iterArg_2 = %221, %iterArg_3 = %210, %iterArg_4 = %217, %iterArg_5 = %208, %iterArg_6 = %213, %iterArg_7 = %214) : tensor<i32>, tensor<i32>, tensor<1xui32>, tensor<1xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
     cond {
      %422 = stablehlo.constant dense<5> : tensor<i32> loc(#loc167)
      %423 = stablehlo.compare  LT, %iterArg, %422,  SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc168)
      stablehlo.return %423 : tensor<i1> loc(#loc167)
    } do {
      %422 = stablehlo.constant dense<1> : tensor<i32> loc(#loc167)
      %423 = stablehlo.add %iterArg_0, %422 : tensor<i32> loc(#loc169)
      %424 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<1> : tensor<1xi64>, start_indices = dense<0> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc170)
      %425 = stablehlo.reshape %424 : (tensor<1xui32>) -> tensor<ui32> loc(#loc171)
      %426 = stablehlo.add %iterArg_1, %iterArg_2 : tensor<1xui32> loc(#loc169)
      %427 = stablehlo.broadcast_in_dim %425, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc172)
      %428 = stablehlo.shift_left %iterArg_2, %427 : tensor<1xui32> loc(#loc172)
      %429 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc167)
      %430 = stablehlo.subtract %429, %425 : tensor<ui32> loc(#loc173)
      %431 = stablehlo.broadcast_in_dim %430, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc174)
      %432 = stablehlo.shift_right_logical %iterArg_2, %431 : tensor<1xui32> loc(#loc174)
      %433 = stablehlo.or %428, %432 : tensor<1xui32> loc(#loc175)
      %434 = stablehlo.xor %426, %433 : tensor<1xui32> loc(#loc176)
      %435 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<2> : tensor<1xi64>, start_indices = dense<1> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc177)
      %436 = stablehlo.reshape %435 : (tensor<1xui32>) -> tensor<ui32> loc(#loc171)
      %437 = stablehlo.add %426, %434 : tensor<1xui32> loc(#loc169)
      %438 = stablehlo.broadcast_in_dim %436, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc172)
      %439 = stablehlo.shift_left %434, %438 : tensor<1xui32> loc(#loc172)
      %440 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc167)
      %441 = stablehlo.subtract %440, %436 : tensor<ui32> loc(#loc173)
      %442 = stablehlo.broadcast_in_dim %441, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc174)
      %443 = stablehlo.shift_right_logical %434, %442 : tensor<1xui32> loc(#loc174)
      %444 = stablehlo.or %439, %443 : tensor<1xui32> loc(#loc175)
      %445 = stablehlo.xor %437, %444 : tensor<1xui32> loc(#loc176)
      %446 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<3> : tensor<1xi64>, start_indices = dense<2> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc178)
      %447 = stablehlo.reshape %446 : (tensor<1xui32>) -> tensor<ui32> loc(#loc171)
      %448 = stablehlo.add %437, %445 : tensor<1xui32> loc(#loc169)
      %449 = stablehlo.broadcast_in_dim %447, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc172)
      %450 = stablehlo.shift_left %445, %449 : tensor<1xui32> loc(#loc172)
      %451 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc167)
      %452 = stablehlo.subtract %451, %447 : tensor<ui32> loc(#loc173)
      %453 = stablehlo.broadcast_in_dim %452, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc174)
      %454 = stablehlo.shift_right_logical %445, %453 : tensor<1xui32> loc(#loc174)
      %455 = stablehlo.or %450, %454 : tensor<1xui32> loc(#loc175)
      %456 = stablehlo.xor %448, %455 : tensor<1xui32> loc(#loc176)
      %457 = "stablehlo.slice"(%iterArg_6) {limit_indices = dense<4> : tensor<1xi64>, start_indices = dense<3> : tensor<1xi64>, strides = dense<1> : tensor<1xi64>} : (tensor<4xui32>) -> tensor<1xui32> loc(#loc179)
      %458 = stablehlo.reshape %457 : (tensor<1xui32>) -> tensor<ui32> loc(#loc171)
      %459 = stablehlo.add %448, %456 : tensor<1xui32> loc(#loc169)
      %460 = stablehlo.broadcast_in_dim %458, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc172)
      %461 = stablehlo.shift_left %456, %460 : tensor<1xui32> loc(#loc172)
      %462 = stablehlo.constant dense<32> : tensor<ui32> loc(#loc167)
      %463 = stablehlo.subtract %462, %458 : tensor<ui32> loc(#loc173)
      %464 = stablehlo.broadcast_in_dim %463, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc174)
      %465 = stablehlo.shift_right_logical %456, %464 : tensor<1xui32> loc(#loc174)
      %466 = stablehlo.or %461, %465 : tensor<1xui32> loc(#loc175)
      %467 = stablehlo.xor %459, %466 : tensor<1xui32> loc(#loc176)
      %468 = stablehlo.broadcast_in_dim %iterArg_3, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc169)
      %469 = stablehlo.add %459, %468 : tensor<1xui32> loc(#loc169)
      %470 = stablehlo.broadcast_in_dim %iterArg_4, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc169)
      %471 = stablehlo.add %467, %470 : tensor<1xui32> loc(#loc169)
      %472 = stablehlo.constant dense<1> : tensor<i32> loc(#loc167)
      %473 = stablehlo.add %iterArg_0, %472 : tensor<i32> loc(#loc169)
      %474 = stablehlo.convert %473 : (tensor<i32>) -> tensor<ui32> loc(#loc180)
      %475 = stablehlo.broadcast_in_dim %474, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc169)
      %476 = stablehlo.add %471, %475 : tensor<1xui32> loc(#loc169)
